{"pageProps":{"source":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, {})\n  })) : _createMdxContent();\n  function _createMdxContent() {\n    const _components = Object.assign({\n      p: \"p\",\n      h2: \"h2\",\n      strong: \"strong\",\n      em: \"em\"\n    }, _provideComponents(), props.components), {Figure} = _components;\n    if (!Figure) _missingMdxReference(\"Figure\", true);\n    return _jsxs(_Fragment, {\n      children: [_jsx(_components.p, {\n        children: \"I wanted to wait a couple days before giving Immortality a review/recommendation because it's kind of a meaty game with a fair bit to chew on.\"\n      }), \"\\n\", _jsx(Figure, {\n        title: \"Immortality ratings\",\n        image: \"immortality-ratings.png\",\n        caption: \"Overall ratings for Immortality\"\n      }), \"\\n\", _jsx(_components.h2, {\n        children: \"TLDR\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"I would give the game a soft recommendation with the expectation that it is artsy so your headspace/mood will affect your enjoyment.\"\n      }), \"\\n\", _jsx(_components.h2, {\n        children: \"My thoughts\"\n      }), \"\\n\", _jsxs(_components.p, {\n        children: [\"I found the game to be gratuitous, pretentious, tedious, and \", _jsx(_components.strong, {\n          children: \"extremely\"\n        }), \" intriguing. My feelings for each of these emotions(?) fluctuated greatly as I played through the gane. As odd as it sounds, I wouldn't really peg any of these as a negative after going through all of the game, and looking up some info on the story that I missed when playing. That brings me to my next point on the story and gameplay. Due to the nature of how you explore the story you see it in a non linear order. You can miss key information when you hit the end point of the story. I had a pretty good grasp on everything that was going on, except after looking up the story in it's entirety, I missed 2 and a half key pieces of information that would have made the ending a lot cooler and a little more explicit. It's something I could have and sort of interpreted, but there was still an air of mystery around what was going on exactly. While that sounds like it could be a positive I feel like if I had known those things the end would have been more powerful.\"]\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"Speaking to that point, I found the gameplay to be really cool, at first. I'm a huge sucker for mixed media and I just wanna shout out that title screen, it's so fucking cool. Anyways, I was glued to the screen for the first 5 or so hours. Something happened after a couple hours that really got me into it and I couldn't stop playing because I was so curious as to what was going on. Having a couple goals of things I wanted to find out helped me stay invested.\"\n      }), \"\\n\", _jsx(_components.h2, {\n        children: \"Gameplay\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"Now, the bad part. I'm gonna warn about potential very light spoilers if you know nothing sbout the game. I'm going to keep it spoiler free, I just need to talk about a mechanic in the game.\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"The whole mechanic of discovering new clips is quite cool, but gets omega tedious after I hit a certain threshold in the game. Picking items and people bring you to from what I can tell to a totally random clip assigned to the same category of that object (eg, glass, painting, specific person). So in the begining everything you find is new, and part of the charm is trying new things thinking of how it could bring you to other scenese. However, this after a while starts to get really annoying because you start cycling through clips you've already seen, and you have no idea if you can find a new clip by clicking on those things. This led to me to stop trying certain things cause I thought I was locked into a set of clips. Going back to the game after looking some things up I was able to get to some important scenes I had missed by clicking on random things for like 5 mins.\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"Another thing that adds to the tedium is not knowing if you should watch something all the way through or just scrub through more quickly. It's a lot of footage so after a couple hours of watching it I would speed some things up if I thought it wasn't important to the story which ended up biting me a couple times. But I think this isn't entirely a fault of the game and partially by design, there needs to be fluff and you finding the meat is definitely a part of it. Something which I don't think is for everyone. I found the actual footage of some of the movies mostly interesting enough.\"\n      }), \"\\n\", _jsxs(_components.p, {\n        children: [\"From the nature of the gameplay when I hit the end point I had missed some key info that I definitely would have liked to see before the end, I personally feel like knowing all the important information is a huge plus. Although, you don't actually know what is necessarily important until you find certain things. It also seems like there is no control over when the game ends, so I didn't get a say as to when I was \", _jsx(_components.em, {\n          children: \"done\"\n        }), \". It kinda sucks in that regard.\"]\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"To speak to the point of calling the game gratuitous and pretentious, the gratuitousness is kinda of eye rolling but it is a little necessary due to the main mechanic of navigating the clips. For the pretentiousness, about 1/2 to 2/3rds in my playthrough I felt like \\\"c'mon guys I get it, this is artistic\\\". BUT after completing the game I totally understand why it feels that way (it's intentional).\"\n      }), \"\\n\", _jsx(_components.h2, {\n        children: \"Would I recommend it\"\n      }), \"\\n\", _jsxs(_components.p, {\n        children: [\"So, my answer on if the game is worth playing or not. I would say while good, interesting, and quite cool, your mileage might vary. It's kind of a cop-out answer but imo I hit a key point at a pretty well timed point into my play session (maybe 2 - 2.5 hours in). I would say if you're really curious after this, do 1 play session for at least 3 hours and if you never hit something and go \", _jsx(_components.strong, {\n          children: \"oh shit\"\n        }), \", stop. It took me just over 9 hours to beat it and another 30 minutes of looking things up to get everything I needed out of the game.\"]\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"Also quick note on the controls. I never found them difficult to work with, maybe messy at the begining but never really struggled. I looked at steam reviews and that seems to be a common complaint. One thing I did use was the triggers for scrubbing through footage which I don't think it mentions in the intro, which I used exclusively after I found that out. I don't know if theres a prompt when starting the game but I would say it is probably mandatory to play the game with a controller.\"\n      })]\n    });\n  }\n}\nreturn {\n  default: MDXContent\n};\nfunction _missingMdxReference(id, component) {\n  throw new Error(\"Expected \" + (component ? \"component\" : \"object\") + \" `\" + id + \"` to be defined: you likely forgot to import, pass, or provide it.\");\n}\n","frontmatter":{},"scope":{}},"frontMatter":{"title":"Immortality - An FMV in this economy?","description":"A brief spoiler free review of the game Immortality.","date":"2023-12-26"},"posts":[{"date":"2023-12-26","slug":"immortality-review"},{"date":"2023-11-25","slug":"game-devlog-part-3"},{"date":"2023-11-06","slug":"game-devlog-part-2"},{"date":"2023-10-15","slug":"game-devlog-part-1"},{"date":"2022-12-29","slug":"celeste-part-3"},{"date":"2022-12-19","slug":"celeste-part-2"},{"date":"2022-12-04","slug":"celeste-part-1"},{"date":"2022-03-26","slug":"tunic-review"},{"date":"2021-08-20","slug":"writing-is-hard"},{"date":"2021-08-04","slug":"mtg-card-seer"},{"date":"2021-07-31","slug":"mtga-july-2021-retrospect"},{"date":"2021-07-29","slug":"deaths-door-review"},{"date":"2021-05-02","slug":"frustrations-of-mtga-client"},{"date":"2021-05-01","slug":"mtga-april-2021-retrospect"},{"date":"2021-04-14","slug":"mtg-deck-archive-2021-04-14"},{"date":"2021-04-12","slug":"strixhaven-historic-shakeup"},{"date":"2021-04-01","slug":"mtga-march-2021-retrospect"},{"date":"2021-03-30","slug":"why-a-blog"}],"slug":"immortality-review"},"__N_SSG":true}