{"pageProps":{"source":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, {})\n  })) : _createMdxContent();\n  function _createMdxContent() {\n    const _components = Object.assign({\n      p: \"p\",\n      h2: \"h2\",\n      strong: \"strong\"\n    }, _provideComponents(), props.components), {Figure} = _components;\n    if (!Figure) _missingMdxReference(\"Figure\", true);\n    return _jsxs(_Fragment, {\n      children: [_jsx(_components.p, {\n        children: \"Hello and welcome to another MTG Arena ranked ladder season in review. This month I played almost exclusively Historic. It was an interesting season as Strixhaven was released half way through it.\"\n      }), \"\\n\", _jsx(_components.h2, {\n        children: \"The before times\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"Before the release of Strixhaven on the 15th, I played primarily Jund Sac. That was the same stock list as last season, and the performance of it was great as expected. Not really anything to talk about there as I was playing it primarily in anticipation for the Strixhaven release. I did play play a handful of standard games with a B/W enchantment midrange deck which was to finish up on daily quests before the release. And on the 15th, everything changed.\"\n      }), \"\\n\", _jsx(Figure, {\n        title: \"Ladder performance\",\n        image: \"april-2021-ladder.jpg\",\n        caption: \"Chart of ladder performance over the course of the MTG Arena season\"\n      }), \"\\n\", _jsxs(_components.p, {\n        children: [\"Strixhaven was released and I immediately built an Izzet Phoenix deck featuring \", _jsx(\"card-link\", {\n          children: \"Faithless Looting\"\n        }), \" and \", _jsx(\"card-link\", {\n          children: \"Brainstorm\"\n        }), \". My win rate went through the roof, and I hit Mythic maybe about 60% of the way through April. The deck was performing extremely well for me, and I got to Mythic early enough in the season that I figured I could probably reach top 1200 at the end of the season and qualify for the Mythic Invitational Qualifier. For this reason, I stuck with playing phoenix throughout the entire season. After a few days and a few iterations, this is the list I landed on and played most of my games with:\"]\n      }), \"\\n\", _jsx(\"deck-list\", {\n        heading: \"Historic Izzet Phoenix\",\n        src: \"/assets/april-2021-phoenix.dec\"\n      }), \"\\n\", _jsx(_components.h2, {\n        children: \"The highs and lows of Mythic\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"I played a fair number of matches with a pretty high win rate up into the higher ranks. There was maybe a week left in the season when I hit around the low 200s in rank. I started playing only 1-2 matches a day at this point since games felt much higher stake and I didn't want to drop a bunch of rank. I hit an all time rank high of 189, which I am very happy with. But, after sitting on my rank a couple days and playing in limited, I came back to play a few games. It was at that point, where going 2-1 in matches for the day actually lost me rank. That felt pretty shitty, to be positive in matches and actually go down in rank, so I sat on my rank for another couple days.\"\n      }), \"\\n\", _jsxs(_components.p, {\n        children: [\"Enter the last 3 days of the season. I hear that I probably will have to continue playing as the last couple days of the season people decay in rank notoriously quickly. So I play some matches. And oh man, did the meta change in those few days. Up until this point I had not played against much phoenix, it did not seem very popular. But now, half of my matches were against phoenix and the other half were against decks designed to just shit on phoenix. I even played against a phoenix deck with \", _jsx(_components.strong, {\n          children: \"multiple\"\n        }), \" main deck \", _jsx(\"card-link\", {\n          children: \"Anger of the Gods\"\n        }), \". It felt like the week and a bit of matches I played after the release of Strixhaven I was just very ahead of the meta, and in the few days I had stopped playing ladder I fell extremely behind the meta. I guess everyone had stopped experimenting with different decks and realized that U/R Phoenix was just a completely insane deck that could play through the few \", _jsx(\"card-link\", {\n          name: \"Grafdigger's Cage\",\n          children: \"Grafdigger's Cage's\"\n        }), \" that people were playing in their boards very easily. I lost a ton of rank playing a bunch of matches and desperately trying to update my deck to a version that could compete in the meta at that moment.\"]\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"At the end of it all, I was very tilted and just played random whatever decks on the last day, falling well into the low %s of Mythic. I'm a little disappointed that I didn't end up in the top 1200. It felt bad sitting on a high rank nearly a week before the end of the season. I have some solace in the fact that I went out swinging. And at the end of the day, I would much rather play and lose then not play in hopes to qualify. I am very happy with how I did and my overall performance. I'm also pretty happy with the fact that I came up with a list that performed incredibly well.\"\n      }), \"\\n\", _jsx(Figure, {\n        title: \"Overall win rate\",\n        image: \"april-2021-winrate.jpg\",\n        caption: \"Overall win rate and highest rank achieved of games played on the ladder\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"Thanks for reading!\"\n      })]\n    });\n  }\n}\nreturn {\n  default: MDXContent\n};\nfunction _missingMdxReference(id, component) {\n  throw new Error(\"Expected \" + (component ? \"component\" : \"object\") + \" `\" + id + \"` to be defined: you likely forgot to import, pass, or provide it.\");\n}\n","frontmatter":{},"scope":{}},"frontMatter":{"title":"MTG Arena April 2021 season in review","description":"A brief review of the past Magic the Gathering Arena monthly ladder season for historic.","date":"2021-05-01"},"posts":[{"date":"2023-12-26","slug":"immortality-review"},{"date":"2023-11-25","slug":"game-devlog-part-3"},{"date":"2023-11-06","slug":"game-devlog-part-2"},{"date":"2023-10-15","slug":"game-devlog-part-1"},{"date":"2022-12-29","slug":"celeste-part-3"},{"date":"2022-12-19","slug":"celeste-part-2"},{"date":"2022-12-04","slug":"celeste-part-1"},{"date":"2022-03-26","slug":"tunic-review"},{"date":"2021-08-20","slug":"writing-is-hard"},{"date":"2021-08-04","slug":"mtg-card-seer"},{"date":"2021-07-31","slug":"mtga-july-2021-retrospect"},{"date":"2021-07-29","slug":"deaths-door-review"},{"date":"2021-05-02","slug":"frustrations-of-mtga-client"},{"date":"2021-05-01","slug":"mtga-april-2021-retrospect"},{"date":"2021-04-14","slug":"mtg-deck-archive-2021-04-14"},{"date":"2021-04-12","slug":"strixhaven-historic-shakeup"},{"date":"2021-04-01","slug":"mtga-march-2021-retrospect"},{"date":"2021-03-30","slug":"why-a-blog"}],"slug":"mtga-april-2021-retrospect"},"__N_SSG":true}